API/toko-api/app/Controllers/LoginController.php

SELECT *
FROM `member`
WHERE `email` = 'alvin@user.com'
 LIMIT 1
---
    public function login() {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $model = new MMember();
        $member = $model->where(['email' => $email])->first();